; domain
(define (domain healthcare)

    (:requirements :strips :typing)

    (:types
        location unit robot box person - object
        guide_robot - robot
        box_robot - robot 
    )

    (:predicates

        (adjacent ?l1 ?l2 - location)
        (belongs ?u - unit ?l - location)
        (atl ?r - robot ?u - location)
        (at ?b - box ?l - location)
        (has ?r - robot ?b - box)
        ; (position ?p - person ?u - unit)
        (contains_bandages ?b - box)
        (has_bandages ?u - unit)
        (is_loading_point ?l - location)
        (free ?r - robot)
        (empty ?b - box)

    )

    (:action move_box
        :parameters (?r - box_robot ?from - location ?to - location ?b - box)
        :precondition (and (atl ?r ?from) (adjacent ?from ?to) (has ?r ?b) (at ?b ?from))
        :effect (and (not (atl ?r ?from)) (not(at ?b ?from)) (atl ?r ?to) (at ?b ?to))
    )

    (:action move_empty
        :parameters (?r - robot ?from - location ?to - location)
        :precondition (and (atl ?r ?from) (adjacent ?from ?to))
        :effect (and (not (atl ?r ?from)) (atl ?r ?to))
    )

    (:action fill_box_bandages
        :parameters (?r - box_robot ?l - location ?b - box)
        :precondition (and (atl ?r ?l) (is_loading_point ?l) (empty ?b) (at ?b ?l) (free ?r))
        :effect (and (not (empty ?b)) (contains_bandages ?b) (not (free ?r)) (has ?r ?b))
    )

    (:action empty_box_bandages
        :parameters (?r - box_robot ?l - location ?b - box ?u - unit)
        :precondition (and (atl ?r ?l) (contains_bandages ?b) (belongs ?u ?l) (at ?b ?l) (has ?r ?b))
        :effect (and (not (contains_bandages ?b)) (empty ?b) (not (has ?r ?b)) (free ?r) (has_bandages ?u))
    )
)

; problem
(define (problem hc1) (:domain healthcare)
(:objects 
r1 - box_robot
l1 l2 - location
u1 u2 - unit
b1 b2 b3 - box
)

(:init
    (adjacent l1 l2)
    (adjacent l2 l1)
    (is_loading_point l1)
    (belongs u1 l2)
    (belongs u2 l2)
    (at b1 l1)
    (at b2 l1)
    (at b3 l1)
    (atl r1 l1)
    (free r1)
    (empty b1)
    (empty b2)
    (empty b3)
)

(:goal (and
    (has_bandages u1)
    (has_bandages u2)
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (fill_box_bandages r1 l1 b3)
   deleted: (empty b3) (free r1)
   added: (contains_bandages b3) (has r1 b3)
   goals met: 0 of 2
2. (move_box r1 l1 l2 b3)
   deleted: (atl r1 l1) (at b3 l1)
   added: (atl r1 l2) (at b3 l2)
   goals met: 0 of 2
3. (empty_box_bandages r1 l2 b3 u1)
   deleted: (contains_bandages b3) (has r1 b3)
   added: (empty b3) (free r1) (has_bandages u1)
   goals met: 1 of 2
4. (move_empty r1 l2 l1)
   deleted: (atl r1 l2)
   added: (atl r1 l1)
   goals met: 1 of 2
5. (fill_box_bandages r1 l1 b2)
   deleted: (empty b2) (free r1)
   added: (contains_bandages b2) (has r1 b2)
   goals met: 1 of 2
6. (move_box r1 l1 l2 b2)
   deleted: (atl r1 l1) (at b2 l1)
   added: (atl r1 l2) (at b2 l2)
   goals met: 1 of 2
7. (empty_box_bandages r1 l2 b2 u2)
   deleted: (contains_bandages b2) (has r1 b2)
   added: (empty b2) (free r1) (has_bandages u2)
   goals met: 2 of 2
